test_cases/kOmega-SST_2D/transient/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.001;
        smoother         DICGaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0.01;
        minIter         1;
    }

    "(U|k|omega)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;  // from elbowUnsteady case 
    nOuterCorrectors 10;         // 50

     residualControl
    {
        "(U|p|omega|k)"
        {
            relTol          0;
            tolerance       1e-07;
        }
    }
}

relaxationFactors // should be testet further 
{
    equations
    {
	U		0.85;
	".*"		0.9;
        U             0.95; // 0.9 is more stable but 0.95 more convergent
        "(k|omega)"   0.95; // 0.9 is more stable but 0.95 more convergent
    }
    fields
    {
	p		0.8;  
    }
}


// ************************************************************************* //
